from heapq import heapify, heappop, heappush

data = [1, 3, 5, 7, 9, 2, 4, 6, 8, 0]
print(data)
heapify(data)  # rearrange the list into heap order
print(data)
heappush(data, -5)  # add a new entry
print(data)
print([heappop(data) for i in range(3)])  # fetch the three smallest entries

# [0단계]
# [1, 3, 5, 7, 9, 2, 4, 6, 8, 0]
#           1
#        /     \
#       3       5
#      / \     / \
#     7   9   2   4
#    / \  /
#   6  8 0

# [1단계] 삼각형에서 가장 낮은 숫자가 위로 이동
#           1
#        /     \
#       3       2     [3, 7, 9] 유지
#      / \     / \    [5, 2, 4] 변경 [2, 5, 4]
#     7   9   5   4
#    / \  /
#   6  8 0

# [2단계]
#           1
#        /     \
#       3       2
#      / \     / \
#     6   9   5   4
#    / \  /            [7, 6, 8] 변경 [6, 7, 8]
#   7  8 0

# [3단계] 0입력 
#           0        [1, 3, 2] 보다 더 작음 (1 -> 0)교체
#        /     \
#       3       2
#      / \     / \
#     6   9   5   4
#    / \
#   7   8

# [3단계-1] 1입력
#           0
#        /     \
#       1       2     [3, 6, 9]보다 작음 (3 -> 1)교체
#      / \     / \
#     6   9   5   4
#    / \
#   7   8

# [3단계-2] 3입력
#           0
#        /     \
#       1       2
#      / \     / \
#     6   3   5   4     [1, 6, 9]에서 가장 큰 9를 밀어냄 (9 -> 3)
#    / \
#   7   8

# [최종] 9입력
#           0
#        /     \
#       1       2
#      / \     / \
#     6   3   5   4
#    / \ /
#   7  8 9
# [0, 1, 2, 6, 3, 5, 4, 7, 8, 9]


# [-5 추가]
#          -5
#        /     \
#       0       2
#      / \     / \
#     6   1   5   4
#    / \  / \
#   7  8 9   3
# [-5, 0, 2, 6, 1, 5, 4, 7, 8, 9, 3]